<?php

if (in_array($userID, $admins)){
 if($msg =="help" || $msg=="Help" || $msg=="راهنما" || $msg=="/help" || $msg=="!help"){
$MadelineProto->messages->sendMessage(['peer' => $chatID, 'reply_to_msg_id' => $msg_id ,'message' => "
❄️ راهنمای سلف بات میدلاین :
⭐️ /bot [on] | [off]
• خاموش و روشن کردن ربات
〰〰〰〰〰〰〰〰〰〰
⭐️ ping
• دریافت وضعیت ربات
〰〰〰〰〰〰〰〰〰〰
⭐️ /chats
•دریافت آمار گروه ها و کاربران
〰〰〰〰〰〰〰〰〰〰
⭐️ typing on
• فعال شدن حالت تایپینگ بعد از هر پیام 
〰〰〰〰〰〰〰〰〰〰
⭐️ typing off
• غیرفعال شدن حالت تایپینگ بعد از هر پیام
〰〰〰〰〰〰〰〰〰〰
⭐️ markread on
• فعال شدن حالت خوانده شدن پیام ها
〰〰〰〰〰〰〰〰〰〰
⭐️ markread off
• غیرفعال شدن حالت خوانده شدن پیام ها
〰〰〰〰〰〰〰〰〰〰
⭐️ flood [NUMBER] [TEXT]
•  اسپم پیام در یک متن
〰〰〰〰〰〰〰〰〰〰
⭐️ spam [NUMBER] [TEXT]
•  اسپم پیام در متن های مجزا
〰〰〰〰〰〰〰〰〰〰
⭐️ contacts on
• فعال شدن حالت ادد شدن مخاطبین به صورت خودکار
〰〰〰〰〰〰〰〰〰〰
⭐️ contacts off
• غیرفعال شدن حالت ادد شدن مخاطبین به صورت خودکار
〰〰〰〰〰〰〰〰〰〰
⭐️ adduser  [UserID] [IDGroup]
• ادد کردن یه کاربر به گروه موردنظر
〰〰〰〰〰〰〰〰〰〰
⭐️ setusername [text] 
• تنظیم نام کاربری (آیدی) ربات
〰〰〰〰〰〰〰〰〰〰
⭐️ profile [NAME] | [LAST] | [BIO]
• تنظیم نام اسم , فامیل و بیوگرافی ربات 
〰〰〰〰〰〰〰〰〰〰
⭐️ /like [TEXT]
• ساخت متن با دکمه لایک
〰〰〰〰〰〰〰〰〰〰
⭐️ /joke
• ارسال جک بصورت اینلاین
〰〰〰〰〰〰〰〰〰〰
⭐️ /fal
• با زدن این دستو فال امروز دریافت کنید
〰〰〰〰〰〰〰〰〰〰
⭐️ /google [TEXT]
• جستجوی یک متن خاص در گوگل
〰〰〰〰〰〰〰
⭐️ /gif [TEXT-EN]
• جستجو و ارسال گیف
〰〰〰〰〰〰〰〰〰〰
⭐️ /pic  [TEXT-EN] 
• جستجو و ارسال عکس
〰〰〰〰〰〰〰〰〰〰
⭐️ /voice  [TEXT] 
• جستجوی ویس و تیکه آهنگ در ملوبات
〰〰〰〰〰〰〰〰〰〰
⭐️ /poker  [on] | [off]
• فعال سازی | غیرفعال سازی حالت ارسال پوکر
〰〰〰〰〰〰〰〰〰〰
⭐️ /blue  [TEXT-EN]
• تبدیل متن انگلیسی به فنت Blue
〰〰〰〰〰〰〰〰〰〰
⭐️ /hidden  [TEXT] | [@username]
•  ساخت متن مخی که فقط توسط فردی خاص قابل مشاهده باشد!
〰〰〰〰〰〰〰〰〰〰
⭐️ /translate  [TEXT]
• ترجمه متن فارسی و انگلیسی
〰〰〰〰〰〰〰〰〰〰
⭐️ /short  [URL]
• کوتاه کننده لینک
〰〰〰〰〰〰〰〰〰〰
⭐️ /apk  [TEXT-EN]
• جستجو و دانلود برنامه اندروید
〰〰〰〰〰〰〰〰〰〰
⭐️ /calc  [TEXT-EN]
• ماشین حساب
〰〰〰〰〰〰〰〰〰〰
⭐️ /sticker  [TEXT]
• تبدیل متن به استیکر
〰〰〰〰〰〰〰〰〰〰
⭐️ /time  [Time-Zone-EN] (iran)
• دریافت ساعت و تاریخ محلی
〰〰〰〰〰〰〰〰〰〰
⭐️ /Timedit
• با زدن این دستو ساعت بطور دقیق ببینید
〰〰〰〰〰〰〰〰〰〰
⭐️ /time
• با زدن این دستو ساعت را دریاف کنید
〰〰〰〰〰〰〰〰〰〰
⭐️ /weather  [TEXT-EN] 
• آب و هوای منطقه
〰〰〰〰〰〰〰〰〰〰
⭐️ block  [@username] 
• بلاک کردن شخصی خاص در ربات
〰〰〰〰〰〰〰〰〰〰
⭐️ unblock  [@username] 
• آزاد کردن شخصی خاص از بلاک در ربات
〰〰〰〰〰〰〰〰〰〰
⭐️ /info  [@username] 
• دریافت اطلاعات کاربر
〰〰〰〰〰〰〰〰〰〰
⭐️ /id
• با ارسال دستو ایدی اصلاعت خود را دریافت کنید
〰〰〰〰〰〰〰〰〰〰
⭐️ /sessions
• دریافت بازنشست های فعال اکانت
〰〰〰〰〰〰〰〰〰〰
⭐️ /save [REPLAY]
• سیو کردن پیام و محتوا  در پیوی خود ربات
〰〰〰〰〰〰〰〰〰〰
⭐️ /download [Link]
• دانلود فایل لینک مورد نظر
🍃#بخش_تنظیم_جواب_سریع :

⭐️ /setanswer [TEXT] | [ANSWER]
• افزودن جواب سریع (متن اول متن دریافتی از کاربر و ددوم جوابی که ربات بدهد)
〰〰〰〰〰〰〰〰〰〰
⭐️ /delanswer [TEXT]
• حذف جواب سریع 
〰〰〰〰〰〰〰〰〰〰
⭐️ /clean answers
• حذف همه جواب سریع ها
〰〰〰〰〰〰〰〰〰〰
⭐️ /answerlist
• لیست همه جواب سریع ها
〰〰〰〰〰〰〰〰〰〰
⭐️ !setenemy [userid]
• تنظیم دشمن با استفاده از ایدی عددی
〰〰〰〰〰〰〰〰〰〰
⭐️ !delenemy [userid]
• حذف دشمن با استفاده از ایدی عددی
〰〰〰〰〰〰〰〰〰〰
⭐️ !enemyon
• روشن کردن وضعیت مواجهه با بدخاه
〰〰〰〰〰〰〰〰〰〰
⭐️ !enemyoff
• خاموش کردن وضعیت مواجهه با بدخاه
〰〰〰〰〰〰〰〰〰〰
⭐️ !cleanenemy
• پاک کردن لیست دشمنان 
〰〰〰〰〰〰〰〰〰〰
⭐️!enemylist
•دریافت لیست دشمنان
〰〰〰〰〰〰〰〰〰〰
⭐️!tak
•فعال کردن فوحش تکی
〰〰〰〰〰〰〰〰〰〰
⭐️!all
فعال کردن فوحش گروهی
〰〰〰〰〰〰〰〰〰〰
⭐️ بکنش
• با ارسال دستور بکنش پاسخ های جالبی دریافت کنید😂
〰〰〰〰〰〰〰〰〰〰
⭐️ بشمار
• با ارسال دستور بشمار ربات از ۱تا۱۰ میشمارد😐
〰〰〰〰〰〰〰〰〰〰
⭐️ بگو[متن شما]
• با زدن این دستو ربات چت شما رو تکرار میکند
〰〰〰〰〰〰〰〰〰〰
⭐️ /My
• با زدن اطلاعت منو دریافت کنید
〰〰〰〰〰〰〰〰〰〰
https://t.me/MrTerminal
",'parse_mode' => 'html']);
}
 
}
